# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   [-1, 1, Silence, []],

   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 1-P1/2

   # conv down
   [-1, 1, SPDConv, [64, 3, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 3

   # avg-conv down
   [-1, 1, SPDConv, [240]],  # 4-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 5

   # avg-conv down
   [-1, 1, SPDConv, [360]],  # 6-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 7

   # avg-conv down
   [-1, 1, SPDConv, [480]],  # 8-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]],  # 9
  ]

# elan head
head:
  [
   [-1, 1, MLCA, []],  #10
   # elan-spp block
   [-1, 1, SPPELAN, [480, 240]],  # 11

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #12
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4   13

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 14

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3  16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 17
   [-1, 1, MultiDilatelocalAttention, []], #18

   # avg-conv-down merge
   [-1, 1, SPDConv, [180]],  #19
   [[-1, 14], 1, Concat, [1]],  # cat head P4 20

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 21 (P4/16-medium)
   [-1, 1, MultiDilatelocalAttention, []], #22

   # avg-conv-down merge
   [-1, 1, SPDConv, [240]],  #23
   [[-1, 11], 1, Concat, [1]],  # cat head P5  24

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]],  # 25 (P5/32-large)
   [-1, 1, MultiDilatelocalAttention, []], #26

   # routing
   [5, 1, CBLinear, [[240]]], # 27
   [7, 1, CBLinear, [[240, 360]]], # 28
   [9, 1, CBLinear, [[240, 360, 480]]], # 29

   # conv down
   [0, 1, Conv, [32, 3, 2]],  # 30-P1/2

   # conv down
   [-1, 1, SPDConv, [64, 3, 2]],  # 31-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 32

   # avg-conv down
   [-1, 1, SPDConv, [240]],   # 33-P3/8
   [[27, 28, 29, -1], 1, CBFuse, [[0, 0, 0]]], # 34

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 35
   [-1, 1, MultiDilatelocalAttention, []], #36

   # avg-conv down
   [-1, 1, SPDConv, [360]],   # 37-P4/16
   [[28, 29, -1], 1, CBFuse, [[1, 1]]], # 38

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 39
   [-1, 1, MultiDilatelocalAttention, []], #40

   # avg-conv down
   [-1, 1, SPDConv, [480]],   # 41-P5/32
   [[29, -1], 1, CBFuse, [[2]]], # 42

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]],  # 43
   [-1, 1, MultiDilatelocalAttention, []], #44

   # detect
   [[36, 40, 44, 18, 22, 26], 1, DualDDetect, [nc]],  # Detect(P3, P4, P5)
  ]
